#Задача:
"""
В дальнейшем мы будем все домашние заданий сдавать в виде ссылок на коммиты в Github.
Так что давайте к этому подготовимся.
Создайте проект в PyCharm или любой удобной вам IDE. Напишите программу, которая выводит:
“Hello from <ваше_имя>”.
На Github создайте репозиторий  LearnQA_Python_API и выложите проект туда. Не забудьте сделать
репозиторий публичным.
Ответом к заданию будет ссылка на ваш репозиторий.
"""

#Ответ:
"""
https://github.com/OBLAKOPOLYAKOV/LearnQA_PythonAPI/commit/273dc3ec81895d2478a4cd3ad1e90738321642a5


"""
print("Hello from Mikhail")
